Курс_Бухгалтерские_задачи/src/Documents/КорректировкаСтоимостиНоменклатуры/КорректировкаСтоимостиНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КорректировкаСтоимостиНоменклатуры</name>
  <registerRecords>AccountingRegister.Проводки</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
</mdclass:Document>

Курс_Бухгалтерские_задачи/src/AccountingRegisters/Проводки/Проводки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Проводки</name>
  <chartOfAccounts>ChartOfAccounts.Бухгалтерский</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Бухгалтерский.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.Количественный</accountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Бухгалтерский.AccountingFlag.Валютный</accountingFlag>
  </resources>
  <resources>
    <name>СуммаХолдинга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Бухгалтерский.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:AccountingRegister>

Курс_Бухгалтерские_задачи/src/ChartsOfAccounts/Бухгалтерский/Бухгалтерский.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfAccounts>
  <name>Бухгалтерский</name>
  <extDimensionTypes>ChartOfCharacteristicTypes.ВидыСубконто</extDimensionTypes>
  <predefined>
    <items>
      <name>Активы</name>
      <description>Активы</description>
      <code>1</code>
      <childItems>
        <name>Касса</name>
        <description>Касса</description>
        <code>1.1</code>
      </childItems>
      <childItems>
        <name>Покупатели</name>
        <description>Покупатели</description>
        <code>1.2</code>
      </childItems>
      <childItems>
        <name>Товары</name>
        <description>Товары</description>
        <code>1.3</code>
      </childItems>
    </items>
    <items>
      <name>Обязательства</name>
      <description>Обязательства</description>
      <code>2</code>
      <accountType>Passive</accountType>
      <childItems>
        <name>Сотрудники</name>
        <description>Сотрудники</description>
        <code>2.1</code>
        <accountType>Passive</accountType>
      </childItems>
      <childItems>
        <name>Поставщики</name>
        <description>Поставщики</description>
        <code>2.2</code>
        <accountType>Passive</accountType>
      </childItems>
    </items>
    <items>
      <name>Капитал</name>
      <description>Капитал</description>
      <code>3</code>
      <accountType>Passive</accountType>
    </items>
    <items>
      <name>СчетАналитикаПереоценки</name>
      <description>Счет аналитика переоценки</description>
      <code>4</code>
      <accountType>ActivePassive</accountType>
    </items>
    <items>
      <name>ТоварыНаХранении</name>
      <description>Товары на хранении</description>
      <code>6</code>
      <offBalance>true</offBalance>
    </items>
  </predefined>
  <attributes>
    <name>ЗапретитьИспользоватьВПроводках</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <accountingFlags>
    <name>УчетПоПодразделениям</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Количественный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <accountingFlags>
    <name>Валютный</name>
    <type>
      <types>Boolean</types>
    </type>
  </accountingFlags>
  <extDimensionAccountingFlags>
    <name>Суммовой</name>
    <type>
      <types>Boolean</types>
    </type>
  </extDimensionAccountingFlags>
</mdclass:ChartOfAccounts>

Курс_Бухгалтерские_задачи/src/ChartsOfCharacteristicTypes/ВидыСубконто/ВидыСубконто.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ВидыСубконто</name>
  <type>
    <types>CatalogRef.Номенклатура</types>
    <types>CatalogRef.ФизическиеЛица</types>
    <types>CatalogRef.ОсновныеСредства</types>
    <types>CatalogRef.Договоры</types>
    <types>CatalogRef.Субконто</types>
    <types>CatalogRef.Склады</types>
    <types>CatalogRef.Контрагенты</types>
    <types>CatalogRef.СтатьиДДС</types>
  </type>
  <predefined>
    <items>
      <name>Договоры</name>
      <description>Договоры</description>
      <code>000000005</code>
      <type>
        <types>CatalogRef.Договоры</types>
      </type>
    </items>
    <items>
      <name>Контрагенты</name>
      <description>Контрагенты</description>
      <code>000000004</code>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </items>
    <items>
      <name>Номенклатура</name>
      <description>Номенклатура</description>
      <code>000000002</code>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </items>
    <items>
      <name>Склады</name>
      <description>Склады</description>
      <code>000000001</code>
      <type>
        <types>CatalogRef.Склады</types>
      </type>
    </items>
    <items>
      <name>Сотрудники</name>
      <description>Сотрудники</description>
      <code>000000003</code>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </items>
    <items>
      <name>СтатьиДДС</name>
      <description>Статьи ДДС</description>
      <code>000000006</code>
      <type>
        <types>CatalogRef.СтатьиДДС</types>
      </type>
    </items>
  </predefined>
</mdclass:ChartOfCharacteristicTypes>

Курс_Бухгалтерские_задачи/src/Documents/КорректировкаСтоимостиНоменклатуры/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
движения.Проводки.Записать();

//Блокировка: организация, Счет=товары
Блокировка = Новый БлокировкаДанных;
ЭлементБД = Блокировка.Добавить("РегистрБухгалтерии.Проводки");
ЭлементБД.УстановитьЗначение("Счет", ПланыСчетов.Бухгалтерский.Товары);
ЭлементБД.УстановитьЗначение("Организация", Организация);
ЭлементБД.Режим = РежимБлокировкиДанных.Исключительный;
Блокировка.Заблокировать();	

//запрос

Запрос = Новый Запрос;
ВидыСубконтоНС = Новый Массив;
ВидыСубконтоНС.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Номенклатура);
ВидыСубконтоНС.Добавить(ПланыВидовХарактеристик.ВидыСубконто.Склады);
Запрос.УстановитьПараметр("ВидыСубконтоНС", ВидыСубконтоНС);
Запрос.УстановитьПараметр("НачМесяца", НачалоМесяца(Дата));
Запрос.УстановитьПараметр("КонМесяца", КонецМесяца(Дата));
Запрос.УстановитьПараметр("Организация", Организация);

Запрос.Текст = 
"ВЫБРАТЬ
|	ОстИОб.Субконто1 КАК Номенклатура,
|	ОстИОб.Субконто2 КАК Склад,
|	ОстИОб.Подразделение КАК Подразделение,
|	(ВЫРАЗИТЬ(ВЫБОР
|			КОГДА ОстИОб.КоличествоНачальныйОстаток + ОстИОб.КоличествоОборотДт = 0
|				ТОГДА 0
|			ИНАЧЕ (ОстИОб.СуммаНачальныйОстаток + ОстИОб.СуммаОборотДт) / (ОстИОб.КоличествоНачальныйОстаток + ОстИОб.КоличествоОборотДт)
|		КОНЕЦ КАК ЧИСЛО(15, 2))) * ОстИОб.КоличествоОборотКт - ОстИОб.СуммаОборотКт КАК Разница
|ИЗ
|	РегистрБухгалтерии.Проводки.ОстаткиИОбороты(&НачМесяца, &КонМесяца, , , Счет = ЗНАЧЕНИЕ(ПланСчетов.Бухгалтерский.Товары), &ВидыСубконтоНС, Организация = &Организация) КАК ОстИОб
|ГДЕ
|	(ВЫРАЗИТЬ(ВЫБОР
|				КОГДА ОстИОб.КоличествоНачальныйОстаток + ОстИОб.КоличествоОборотДт = 0
|					ТОГДА 0
|				ИНАЧЕ (ОстИОб.СуммаНачальныйОстаток + ОстИОб.СуммаОборотДт) / (ОстИОб.КоличествоНачальныйОстаток + ОстИОб.КоличествоОборотДт)
|			КОНЕЦ КАК ЧИСЛО(15, 2))) * ОстИОб.КоличествоОборотКт - ОстИОб.СуммаОборотКт <> 0";

Результат = Запрос.Выполнить();

Выборка = Результат.Выбрать();

Движения.Проводки.Записывать = Истина;

Пока Выборка.Следующий() Цикл

//можно рассчитать себестоимость

Движение = Движения.Проводки.Добавить();
Движение.СчетДт = ПланыСчетов.Бухгалтерский.Капитал;
Движение.СчетКт = ПланыСчетов.Бухгалтерский.Товары;
БухгалтерияСервер.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, "Номенклатура", Выборка.Номенклатура);
БухгалтерияСервер.УстановитьСубконто(Движение.СчетКт, Движение.СубконтоКт, "Склады", Выборка.Склад);

Движение.Период = Дата;
Движение.Сумма = Выборка.Разница;
//Движение.КоличествоКт = Выборка.Количество;
Движение.Содержание = "стоимость";
Движение.Организация = Организация;
БухгалтерияСервер.УстановитьПодразделенияПроводки(Движение, Выборка.Подразделение, Выборка.Подразделение);


КонецЦикла;

КонецПроцедуры
